app/views/bookings/_active_bookings.html.erb

          <td>Owner</td>
          <td><%= booking.car.user.firstname %></td>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."user_id" = $1 ORDER BY "cars"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]