app/views/bookings/owner_bookings.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                <td>Guest</td>
                <td><%= booking.user.firstname %></td>