source/app/controllers/bookings_controller.rb

  def new

    @car = Car.find(params[:car_id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create

    @car = Car.find(params[:booking][:car_id])
    @booking = Booking.new(booking_params)
    @booking.user_id = current_user.id
    @booking.price_per_day = @car.price_per_day
    @booking.price_per_km = @car.price_per_km
    @booking.save
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "car_id", "price_per_day", "price_per_km", "date_from", "date_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def owner_bookings

    @car = Car.find(params[:car_id])

    if params[:booking_id]
      @booking = Booking.find(params[:booking_id])

      if params[:odo_start]
        @booking.update(odo_start: params[:odo_start])
      end

      if params[:odo_end]
        @booking.update(odo_end: params[:odo_end], active: false)
      end
    end

    @guest = false
    @active = false
    @active2 = false
    @previous = false

    @bookings = []

    @car.bookings.each do |booking|
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."car_id" = $1  [["car_id", 1]]

  def guest_trips

    @guest = true
    @active = false
    @previous = false
    @active2 = false

    @bookings = []

    current_user.bookings.each do |booking|
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 ORDER BY "bookings"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]