app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index

    if params[:user_location]
      if location = Geocoder.coordinates(params[:user_location])
        @latitude = location[0]
        @longitude = location[1]
      else
        @latitude = -27.4698
        @longitude = 153.0251
      end
    else
      @latitude = -27.4698
      @longitude = 153.0251
    end


    @cars = []

    @un_available_cars = []

    if params[:booking][:date_from].to_i == 0 || params[:booking][:date_to].to_i == 0

      Car.all.each do |car|

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."car_id" = $1 ORDER BY "bookings"."id" ASC LIMIT $2  [["car_id", 1], ["LIMIT", 1]]
---

      search_dates = []

      (params[:booking][:date_from].to_date..params[:booking][:date_to].to_date).each do |date|