app/controllers/charges_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @booking = Booking.find(params[:booking])
    @amount = @booking.price_per_day
    @car = Car.find(@booking.car_id)

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bookings" SET "paid" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["paid", "t"], ["updated_at", "2018-05-10 14:35:31.001250"], ["id", 1]]
---
  def create

    @car = Car.find(params[:car_id])
    @booking = Booking.find(params[:booking])
    @booking.update(paid: true)