source/app/views/charges/create.html.erb

      <div class="">
        <span class="text-muted"><%= "#{@car.user.firstname.capitalize}'s" %></span>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]